In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

titanic_df = pd.read_csv('C:/Users/sw993/PerfectGuide-master/1장/train.csv')

from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

from sklearn.preprocessing import StandardScaler

In [2]:
# 순서
# fillna 로 Null 값 삭제
# One - Hot Encoder로 진행
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [4]:
titanic_df.drop(['Name','PassengerId','Ticket'], axis=1, inplace=True)

In [5]:
titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)
titanic_df['Cabin'].fillna('N', inplace=True)
titanic_df['Embarked'].fillna('N', inplace=True)

In [6]:
titanic_df['Sex'] = titanic_df['Sex'].apply(lambda x : 0 if x == 'male' else 1)

In [7]:
titanic_df.head(3)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    0  22.0      1      0   7.2500     N        S
1         1       1    1  38.0      1      0  71.2833   C85        C
2         1       3    1  26.0      0      0   7.9250     N        S

In [8]:
titanic_df.drop('Cabin',axis=1, inplace=True)
titanic_df.head(3)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    0  22.0      1      0   7.2500        S
1         1       1    1  38.0      1      0  71.2833        C
2         1       3    1  26.0      0      0   7.9250        S

In [9]:
titanic_df['Embarked'].value_counts()

S    644
C    168
Q     77
N      2
Name: Embarked, dtype: int64

In [10]:
one_hot_Embarked = pd.get_dummies(titanic_df['Embarked'])
one_hot_Embarked.head(3)

   C  N  Q  S
0  0  0  0  1
1  1  0  0  0
2  0  0  0  1

In [11]:
one_hot_Embarked.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C       891 non-null    uint8
 1   N       891 non-null    uint8
 2   Q       891 non-null    uint8
 3   S       891 non-null    uint8
dtypes: uint8(4)
memory usage: 3.6 KB

In [12]:
one_hot_Embarked.isnull().sum()

C    0
N    0
Q    0
S    0
dtype: int64

In [13]:
df = pd.concat([titanic_df,one_hot_Embarked],axis=1)
df.head(3)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked  C  N  Q  S
0         0       3    0  22.0      1      0   7.2500        S  0  0  0  1
1         1       1    1  38.0      1      0  71.2833        C  1  0  0  0
2         1       3    1  26.0      0      0   7.9250        S  0  0  0  1

In [14]:
df.drop('Embarked',axis=1,inplace=True)

In [15]:
df.head(3)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  C  N  Q  S
0         0       3    0  22.0      1      0   7.2500  0  0  0  1
1         1       1    1  38.0      1      0  71.2833  1  0  0  0
2         1       3    1  26.0      0      0   7.9250  0  0  0  1

In [16]:
from sklearn.model_selection import train_test_split

In [17]:
df_train = df.iloc[:,1:]
df_test = df.iloc[:,0]

In [18]:
df_train.head(3)

   Pclass  Sex   Age  SibSp  Parch     Fare  C  N  Q  S
0       3    0  22.0      1      0   7.2500  0  0  0  1
1       1    1  38.0      1      0  71.2833  1  0  0  0
2       3    1  26.0      0      0   7.9250  0  0  0  1

In [19]:
X_train,X_test,y_train,y_test = train_test_split(df_train,
                                                df_test, test_size=0.2)

In [22]:
dt_clf = DecisionTreeClassifier()
rf_clf = RandomForestClassifier()
lr_clf = LogisticRegression()

In [23]:
clfs = [dt_clf,rf_clf,lr_clf]
for clf in clfs:
    clf.fit(X_train,y_train)
    pred = clf.predict(X_test)
    print(clf,np.round(accuracy_score(pred,y_test),4))
    pred = []

DecisionTreeClassifier() 0.8212
RandomForestClassifier() 0.8492
LogisticRegression() 0.8045

C:\Users\sw993\anaconda3\envs\test1\lib\site-packages\sklearn\linear_model\_logistic.py:762: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [24]:
from sklearn.model_selection import GridSearchCV

parameters = {'max_depth':[2,3,5,10],
             'min_samples_split':[2,3,5], 'min_samples_leaf':[1,5,8]}

grid_dclf = GridSearchCV(dt_clf , param_grid=parameters , scoring='accuracy' , cv=5)
grid_dclf.fit(X_train , y_train)

print('GridSearchCV 최적 하이퍼 파라미터 :',grid_dclf.best_params_)
print('GridSearchCV 최고 정확도: {0:.4f}'.format(grid_dclf.best_score_))
best_dclf = grid_dclf.best_estimator_

# GridSearchCV의 최적 하이퍼 파라미터로 학습된 Estimator로 예측 및 평가 수행. 
dpredictions = best_dclf.predict(X_test)
accuracy = accuracy_score(y_test , dpredictions)
print('테스트 세트에서의 DecisionTreeClassifier 정확도 : {0:.4f}'.format(accuracy))

GridSearchCV 최적 하이퍼 파라미터 : {'max_depth': 3, 'min_samples_leaf': 5, 'min_samples_split': 2}
GridSearchCV 최고 정확도: 0.8104
테스트 세트에서의 DecisionTreeClassifier 정확도 : 0.8380